---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRectangleParameterized
source: html/e0c961d7-6ed4-9904-249e-29d26fffaf24.htm
---
# StructuralSectionRectangleParameterized Members

Creates a new instance of Structural Section Rectangle Parameterized shape with the associated set of parameters,
 used to attach to structural element.